cookbook = [
    ['Салат',
     [['картофель', 100, 'гр.'], ['морковь', 50, 'гр.'], ['огурцы', 50, 'гр.'], ['горошек', 30, 'гр.'], ['майонез', 70, 'мл.']]],
    ['Пицца',
     [['сыр', 50, 'гр.'], ['томаты', 50, 'гр.'], ['тесто', 100, 'гр.'], ['бекон', 30, 'гр.'], ['колбаса', 30, 'гр.'], ['грибы', 20, 'гр.']]],
    ['Фруктовый десерт',
     [['хурма', 60, 'гр.'], ['киви', 60, 'гр.'], ['творог', 60, 'гр.'], ['сахар', 10, 'гр.'], ['мед', 50, 'мл.'],]]]

cookbook_dict = {'Салат': [['картофель', 100, 'гр.'], ['морковь', 50, 'гр.'], ['огурцы', 50, 'гр.'], ['горошек', 30, 'гр.'], ['майонез', 70, 'мл.']],
                 'Пицца': [['сыр', 50, 'гр.'], ['томаты', 50, 'гр.'], ['тесто', 100, 'гр.'], ['бекон', 30, 'гр.'], ['колбаса', 30, 'гр.'], ['грибы', 20, 'гр.']],
                 'Фруктовый десерт': [['хурма', 60, 'гр.'], ['киви', 60, 'гр.'], ['творог', 60, 'гр.'], ['сахар', 10, 'гр.'], ['мед', 50, 'мл.']]}

cookbook_tuple = (
    ['Салат',
     [['картофель', 100, 'гр.'], ['морковь', 50, 'гр.'], ['огурцы', 50, 'гр.'], ['горошек', 30, 'гр.'], ['майонез', 70, 'мл.']]],
    ['Пицца',
     [['сыр', 50, 'гр.'], ['томаты', 50, 'гр.'], ['тесто', 100, 'гр.'], ['бекон', 30, 'гр.'], ['колбаса', 30, 'гр.'], ['грибы', 20, 'гр.']]],
    ['Фруктовый десерт',
     [['хурма', 60, 'гр.'], ['киви', 60, 'гр.'], ['творог', 60, 'гр.'], ['сахар', 10, 'гр.'], ['мед', 50, 'мл.'],]])


product_list_1 = ['Салат: картофель 500 гр., морковь 250 гр., огурцы 250 гр., горошек 150 гр., майонез 350 мл.',
                'Пицца: сыр 250 гр., томаты 250 гр., тесто 500 гр., бекон 150 гр., колбаса 150 гр., грибы 100 гр.',
                'Фруктовый десерт: хурма 300 гр., киви 300 гр., творог 300 гр., сахар 50 гр., мед 250 мл.']
product_list_2 = ['Салат: картофель 1000 гр., морковь 500 гр., огурцы 500 гр., горошек 300 гр., майонез 700 мл.',
                'Пицца: сыр 500 гр., томаты 500 гр., тесто 1000 гр., бекон 300 гр., колбаса 300 гр., грибы 200 гр.',
                'Фруктовый десерт: хурма 600 гр., киви 600 гр., творог 600 гр., сахар 100 гр., мед 500 мл.']




def calculate_products(cookbook, person):
    products = []
    for dish in cookbook:
        dish_recipe = f'{dish[0]}: '
        for ingredient in dish[1]:
            dish_recipe += " ".join([ingredient[0], str(ingredient[1] * person), ingredient[2]])
            dish_recipe += ", "
        products.append(dish_recipe[0:-2])
    return products


if __name__ == '__main__':

    result = calculate_products(cookbook_tuple, 10)
    assert result == product_list_2, f"Неверный результат: {result}"
    print(f"Список покупок на 5 персон: {result}")
